# # YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# # Parameters
# nc: 1  # number of classes
# depth_multiple: 0.33  # model depth multiple
# width_multiple: 0.50  # layer channel multiple
# anchors:
#   - [10,13, 16,30, 33,23]  # P3/8
#   - [30,61, 62,45, 59,119]  # P4/16
#   - [116,90, 156,198, 373,326]  # P5/32

# # YOLOv5 v6.0 backbone
# backbone:
#   # [from, number, module, args]
#   [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
#    [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
#    [-1, 3, C3, [128]],
#    [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
#    [-1, 6, C3, [256]],
#    #[-1, 1, SimAM, [256]],#添加的一层5
#    [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
#    [-1, 9, C3, [512]],
#    #[-1, 1, SimAM, [512]],#添加的一层
#    [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
#    [-1, 3, C3, [1024]],
#    #[-1, 3, SimAM, [1024]],#添加的一层
#    [-1, 1, SPPF, [1024, 5]], # 9
   
#   ]

# # YOLOv5 v6.0 head
# # head:
# #   [[-1, 1, GhostConv, [512, 1, 1]],
# #    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
# #    [[-1, 6], 1, Concat, [1]],  # cat backbone P4
# #    [-1, 3, C3Ghost, [512, False]],  # 13

# #    [-1, 1, GhostConv, [256, 1, 1]],
# #    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
# #    [[-1, 4], 1, Concat, [1]],  # cat backbone P3
# #    [-1, 3, C3Ghost, [256, False]],  # 17 (P3/8-small)

# #    [-1, 1, GhostConv, [256, 3, 2]],
# #    [[-1, 14], 1, Concat, [1]],  # cat head P4
# #    [-1, 3, C3Ghost, [512, False]],  # 20 (P4/16-medium)

# #    [-1, 1, GhostConv, [512, 3, 2]],
# #    [[-1, 10], 1, Concat, [1]],  # cat head P5
# #    [-1, 3, C3Ghost, [1024, False]],  # 23 (P5/32-large)
# #    [-1, 1, SimAM, [1024]], #修改

# #    [[17, 20, 24], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
# #   ]

# head:
#   [[-1, 1, GhostConv, [512, 1, 1]],  
#    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#    [[-1, 6], 1, Concat, [1]],  # cat backbone P4
#    [-1, 3, C3Ghost, [512, False]],  # 13
#    [-1, 1, SimAM, [512]],  # 添加SimAM注意力层在P4的C3Ghost之后

#    [-1, 1, GhostConv, [256, 1, 1]],
#    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#    [[-1, 4], 1, Concat, [1]],  # cat backbone P3
#    [-1, 3, C3Ghost, [256, False]],  # 17 (P3/8-small)
#    [-1, 1, SimAM, [256]],  # 添加SimAM注意力层在P3的C3Ghost之后   19

#    [-1, 1, GhostConv, [128, 3, 2]],  # 新增P2检测头，放在P3之前
#    [[-1, 2], 1, Concat, [1]],  # cat backbone P2
#    [-1, 3, C3Ghost, [128, False]],  # 新增检测头 (P2/4-smaller)
#    [-1, 1, SimAM, [128]],  # 添加SimAM注意力层在P2的C3Ghost之后   23

#    [-1, 1, GhostConv, [256, 3, 2]],
#    [[-1, 15], 1, Concat, [1]],  # cat head P4
#    [-1, 3, C3Ghost, [512, False]],  # 20 (P4/16-medium)
#    [-1, 1, SimAM, [512]],  # 添加SimAM注意力层在P4的C3Ghost之后    27

#    [-1, 1, GhostConv, [512, 3, 2]],
#    [[-1, 10], 1, Concat, [1]],  # cat head P5
#    [-1, 3, C3Ghost, [1024, False]],  # 23 (P5/32-large)
#    [-1, 1, SimAM, [1024]],  # 添加SimAM注意力层在P5的C3Ghost之后   31

#    [[19, 23, 27, 31], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
#   ]


  # YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   #[-1, 1, SimAM, [256]],#添加的一层5
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   #[-1, 1, SimAM, [512]],#添加的一层
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SimAM, [1024]],#添加的一层
   [-1, 1, SPPF, [1024, 5]], # 9
   
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, GhostConv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3Ghost, [512, False]],  # 13

   [-1, 1, GhostConv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3Ghost, [256, False]],  # 17 (P3/8-small)

   [-1, 1, GhostConv, [256, 3, 2]],
   [[-1, 15], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3Ghost, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, GhostConv, [512, 3, 2]],
   [[-1, 11], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3Ghost, [1024, False]],  # 23 (P5/32-large)
   [-1, 1, SimAM, [1024]],#添加的一层

   [[18, 21, 25], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]


